driver-tests/bpelse/eventHandlers/onAlarmJbi/src/jbiServiceUnits/onAlarm/onAlarmForAndRepeatEvery/onAlarmForAndRepeatEvery.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="http://j2ee.netbeans.org/wsdl/onAlarmForAndRepeatEvery"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/onAlarmForAndRepeatEvery" name="onAlarmForAndRepeatEvery" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types/>
    <message name="onAlarmForAndRepeatEveryOperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <message name="onAlarmForAndRepeatEveryOperationReply">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="onAlarmForAndRepeatEveryPortType">
        <wsdl:operation name="onAlarmForAndRepeatEveryOperation">
            <wsdl:input name="input1" message="tns:onAlarmForAndRepeatEveryOperationRequest"/>
            <wsdl:output name="output1" message="tns:onAlarmForAndRepeatEveryOperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="onAlarmForAndRepeatEveryBinding" type="tns:onAlarmForAndRepeatEveryPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="onAlarmForAndRepeatEveryOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/onAlarmForAndRepeatEvery"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/onAlarmForAndRepeatEvery"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="onAlarmForAndRepeatEveryService">
        <wsdl:port name="onAlarmForAndRepeatEveryPort" binding="tns:onAlarmForAndRepeatEveryBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/onAlarmForAndRepeatEveryService/onAlarmForAndRepeatEveryPort"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="onAlarmForAndRepeatEvery1">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="onAlarmForAndRepeatEveryPortTypeRole" portType="tns:onAlarmForAndRepeatEveryPortType"/>
    </plnk:partnerLinkType>
</definitions>
