driver-tests/bpelse/eventHandlers/onAlarmJbi/test/onAlarmForAndRepeatEvery/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:onal="http://j2ee.netbeans.org/wsdl/onAlarmForAndRepeatEvery">
  <soapenv:Body>
    <onal:onAlarmForAndRepeatEveryOperation>
      <part1>*input*</part1>
    </onal:onAlarmForAndRepeatEveryOperation>
  </soapenv:Body>
</soapenv:Envelope>